var quiz=[
  {
    "question" : "한라산의 해발 높이는 몇 미터인가?",
    "examples":[
      '1,940m',
      '1,947m',
      '1,980m',
      '1,923m'
    ],
    hit:2, //정답
    "ex":[
      '답은 2번이다',
      '해설 : 한라산은 대한민국에서 가장 큰 산으로 해발 1,947m이다'
    ]
  },

  {
    "question" : "제주 말로 아주 깊다라는 의미에서 '만쟁이거머리굴' 이라고 불리는 이 동굴의 이름은 무엇일까?",
    "examples":[
      '김녕사굴',
      '미천굴',
      '만장굴',
      '용천동굴',
    ],
    hit:3,
    "ex":[
      '답은 3번이다',
      '해설 : 만장굴은 아주깊다라는 의미에서 유래되었다'
    ]
},
  {
    "question" : "제주 방언 중 '어드레 감디?'는 무슨 뜻인가?",
    "examples":[
      '어디로 가느냐?',
      '어떻게 가니?',
      '어서 오십시오',
      '무엇을 하십니끼?',
    ],
    hit:1,
    "ex":[
      '답은 1번이다',
      '해설 : 어디가 어드레, 감디가 가느냐라는 뜻이다'
    ],
  },

  {
    "question" : "제주도의 특산물이 아닌 것은?",
    "examples":[
      '한라봉',
      '은갈치',
      '흑돼지',
      '현무암',
    ],
    hit:4,
    "ex":[
      '답은 4번이다',
      '해설 : 제주도 특산물에는 감귤, 옥돔, 갈치, 삼다수, 말고기 등등 있다.'
    ]
  },

  {
    "question" : "2018년 3월 30일 정식 개장된 제주도 야시장은?",
    "examples":[
      '동문 시장 야시장',
      '올레 시장 야시장',
      '서문 시장 야시장',
      '보성 시장 야시장',
    ],
    hit:1,
    "ex":[
      '답은 1번이다',
      '해설 : 제주 동문시장 야시장은 3월 7일부터 시범운영하다가 3월 30일에 정식 개장했다'
    ]
  },

  {
    "question" : "제주도는 흔히 삼다도라고 한다. 이때, 삼다의 요소에 해당하지 않는 것은?",
    "examples":[
      '돌',
      '말',
      '여자',
      '바람',
    ],
    hit:2,
    "ex":[
      '답은 2번이다',
      '해설 : 삼다도에는 여자, 돌, 바람이 포함된다'
    ]
  },

  {
    "question" : "제주 방언 중 '제기제기'는 무슨 뜻인가?",
    "examples":[
      '빨리빨리',
      '많이많이',
      '조금조금',
      '찔끔찔끔',
    ],
    hit:1,
    "ex":[
      '답은 1번이다',
      '해설 : 제기제기는 빨리빨리라는 뜻이다.'
    ]
  },

  {
    "question" : "제주에는 소형 화산체인 오름이 많다. 제주의 오름의 총 갯수는 몇개일까?",
    "examples":[
      '365개',
      '355개',
      '368개',
      '367개',
    ],
    hit:3,
    "ex":[
      '답은 3번이다',
      '해설 : 제주 오름은 총 368개이다'
    ]
  },

  {
    "question" : "제주도에는 여러개의 해변이 있다. 보기 중  제주시에 속하는 해변은?",
    "examples":[
      '월정리 해변',
      '중문 해변',
      '표선 해변',
      '하모 해변',
    ],
    hit:1,
    "ex":[
      '답은 1번이다',
      '해설 : 중문 해변은 서귀포시 색달동, 표선 해변은 서귀포시 표선읍, 하모 해변은 서귀포시 대정읍에 위치한다'
    ]
  },

  {
    "question" : "제주 자연 문화재 중 유네스코 세계 자연 유산에 등재되지 않는 자연 문화재는 무엇일까?",
    "examples":[
      '만장굴',
      '거문오름',
      '성산 일출봉',
      '주상절리',
    ],
    hit:4,
    "ex":[
      '답은 4번이다',
      '해설 : 제주 주상절리는 등재되지 않았으며, 무등산 주상절리대는 세계 자연 유산으로 추진중이다'
    ]
  },

  {
    "question" : "유네스코는 오랜 세월 이이온 이 문화의 가치와 보전성의 필요성을 인정해 2016년도에 인류 무형 문화유산으로 등재했다. 이 문화는 무엇일까?",
    "no1" : "① 판소리",
    "no2" : "② 해녀",
    "no3" : "③ 설문대할망",
    "no4" : "④ 정월대보름"
  },
  {
    "question" : "제주도의 최남단에 위치한 섬의 이름은 무엇일까?",
    "no1" : "① 마라도",
    "no2" : "② 비양도",
    "no3" : "③ 가파도",
    "no4" : "④ 우도"
  },
  {
    "question" : "1947년 3월 1일을 기점으로 하여 1948년 4월 3일 발생한 소요사태 및 1954년 9월 21일까지 제주도에서 발생한 무력충돌과 진압과정에서 주민들이 희생당한 사건은?",
    "no1" : "① 4.3 사건",
    "no2" : "② 곤을동 사건",
    "no3" : "③ 한모살 사건",
    "no4" : "④ 오라리 사건"
  },
  {
    "question" : "제주 방언 중 '도체비꽃'은 무슨 뜻인가?",
    "no1" : "① 유체꽃",
    "no2" : "② 수국",
    "no3" : "③ 동백",
    "no4" : "④ 벚꽃"
  },
  {
    "question" : "이 음식은 제주도 여름철에 즐기는 음식으로 회를 떠서 무친다음 물을 부어먹는다. 이 음식은 무엇일까?",
    "no1" : "① 둠베고기",
    "no2" : "② 빙떡",
    "no3" : "③ 오메기떡",
    "no4" : "④ 자리돔물회"
  },
  {
    "question" : "매년 1월 25일부터 2월 1일까지를 제주도에서는 '묵은 철과 새 철의 사이' 뜻을 가진 이 기간은 이사의 기간이라고 불릴 정도로 이사가 활발하게 일어난다. 이 기간의 이름은 무엇일까?",
    "no1" : "① 포제단",
    "no2" : "② 당",
    "no3" : "③ 신구간",
    "no4" : "④ 굿"
  },
  {
    "question" : "제주 방언 중 '모사 분다'는 무슨 뜻인가?",
    "no1" : "① 왜불러",
    "no2" : "② 부셔버린다",
    "no3" : "③ 때린다",
    "no4" : "④ 혼낸다"
  },
  {
    "question" : "제주의 숨은 비경 31곳 중 하나이며 삼나무, 졸참나무 등 다양한 수종이 서식하고 있는 이곳은 트래킹의 명소로 불리어진다. 이곳은 어디일까?",
    "no1" : "① 사려니숲길",
    "no2" : "② 올레길",
    "no3" : "③ 산굼부리",
    "no4" : "④ 한라산"
  },
  {
    "question" : "이 곳은 제주에 현존하는 건물 중 가장 오래된 건물로 조선시대 세종 때 세워졌다. 병사들의 훈련장으로 사용하기 위해 창건된 이 곳은 어디일까?",
    "no1" : "① 왜불러",
    "no2" : "② 하논마르",
    "no3" : "③ 통일관",
    "no4" : "④ 관덕정"
  },
  {
    "question" : "제주 방언 중 '클르다'는 무슨 뜻인가?",
    "no1" : "① 캐다",
    "no2" : "② 클난다",
    "no3" : "③ 풀다",
    "no4" : "④ 매우크다"
  }
];

var no=0;

function printQuiz(){

  var question=quiz[no];

  var num=no+1; //num은 앞에 문제 번호를 붙이기 위해 선언한 변수로 no가 0이기 때문에 1을 더함

  $('tbody').append('<tr>');
  $('tbody').append('<td colspan="2" style="font-family:나눔고딕; font-size:30px; color:#010730; padding: 0 12px 40px 12px; font-weight:bold">'+num+'. '+quiz[no]['question']+'</td>'+'</tr>');
  // ↑ 문제를 테이블에 넣는 코드
  $('tbody').append('<tr>'+'<td height="30px">'+'</td>'+'</tr>');
  // ↑ 문제와 보기 사이에 여백을 주는 코드

  for(var a=0; a < question.examples.length; a++){
    if(a%2==0){
      $('tbody').append('<tr>');
      // 보기를 두개씩 주기 위해 2의 배수로 나눠서 나눠떨어질 때만 tr을 삽입하도록 함
    }
    $('tbody').append('<td style="font-family:나눔고딕; font-size:20px; color:#010730;"><input name="q"'+no+'" type="radio" value="'+a+'">'+question.examples[a]+'</td>');
    if(a%2!=0){
      $('tbody').append('</tr>');
      $('tbody').append('<tr>'+'<td height="20px"'+'</td>'+'</tr>');
    }
    // 문제 value값 순서
    // 0  1
    // 2  4
  }
  $('tbody').append('<tr>'+'<td height="40px"'+'</td>'+'</tr>');

}

var temp;
printQuiz();
$('#submitButton').click(function(){
      console.log('click');
      temp=no;
      no=no+1; //정답 확인을 하면 no값을 한단계 증가 시켜 다음 문제로 넘어갈 준비를 함.
      if(temp!==no && quiz.length>no){
        printQuiz();
      }
      console.log(no);
  })
